Revit 2027 API
CurveArrArray.Append Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Append(
	CurveArray item
)
Public Overridable Sub Append (
	item As CurveArray
)
public:
virtual void Append(
	CurveArray^ item
)
abstract Append :
        item : CurveArray -> unit
override Append :
        item : CurveArray -> unit
Parameters
item CurveArray
See Also
Reference
CurveArrArray Class
Autodesk.Revit.DB Namespace